// چرا ریکت سریعه؟
// چون از ویرچوال دام و کامپوننت ها استفاده میکنه.

/**************************************************************/
// کامپوننت چیه؟
// تیکه ای از یو آی که مستقله، قابل استفاده مجدد هست و میشه تو پروژه های دیگه هم ازشون استفاده کرد

/**************************************************************/
// ویرچوال دام چجوری کار میکنه؟
// ویرچوال دام یک کپی از دام واقعیه و هر تغییری که توی بخشی از برنامه ایجاد بشه، متوجه میشه و میره فقط همون بخش رو اپدیت میکنه که این باعث میشه سرعت رندر شدن برنامه بره بالاتر

/**************************************************************/
// چیه؟ webpack
// یا یکی میکنه bundle میاد کدهای جی اس، سی اس اس، فایل های پی ان جی و همه ی اینارو

/**************************************************************/
// چیه؟ babel
// رو به کدهایی تبدیل میکنه که برای همه ی مرورگرها قابل فهم باشه ES6 یک جاوااسکریپت کامپایلره. میاد کدهای جاوااسکریپت مخصوصا کدهای

/**************************************************************/
// قابل مشاهده س package.json ِهر پکیجی که به کمک نود جی اس نصب میکنیم تو قسمت دپندنسی

/**************************************************************/
// یا همون پراپرتیز یک آبجکته Props

/**************************************************************/
// state و props:
// این دو دیتاهایی هستند که به کمک اونا اپلیکیشن خودمون رو داینامیک میکنیم
// تنها با تغییر پراپز و/یا استیت کامپوننت ما دوباره "ری ریندر" میشه

// اما استیت لوکال هست و فقط در همون کامپوننتی که تعریف شده قابل استفاده س
// اما دیتاهای پراپز، از کامپوننت پدر یا کامپوننت های دیگه به کامپوننت موردنظر پاس داده میشه

/**************************************************************/
// استیت یک پراپرتیه= که هر نوع دیتایی رو میگیره، اما ست استیت یک متوده({})، که یک ابجکت میگیره

/**************************************************************/
// هوک چیه؟
// هوک ها به ریکت اضافه شدن تا بتونیم از استیت و لایف سایکل ها در فانکشنال کامپوننت ها استفاده کنیم

/**************************************************************/
// useState:
// از یوزاستیت ها اینجوری توی فانکشنال کامپوننت ها استفاده میشه:
// const [...] = useState([]) -> چون یه ارایه برمیگردونه

/**************************************************************/
// استیت هرچقد دیتا داشته باشه تو همون یه دونه دیتا تعریف میشه
// ولی توی یوزاستیت، هر بار باید یه کانست جدید تعریف شه

/**************************************************************/
// در مپ استفاده میکنیم؟ key چرا از!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//ماش همدانی
/**************************************************************/
// چرا استفاده از ایندکس در مپ توصیه نمیشه؟!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// سرچ
/**************************************************************/
// هرجا که استیت هست و قراره تغییر کنه، هندلرها هم همون جا نوشته میشن

/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
/**************************************************************/
